CSI API ETABS v1

# cFrameObjGetSupports Method

---

Retrieves support data for a given frame beam object

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSupports(
    	string Name,
    	ref string SupportName1,
    	ref eObjType SupportType1,
    	ref string SupportName2,
    	ref eObjType SupportType2
    )

    Function GetSupports (
    	Name As String,
    	ByRef SupportName1 As String,
    	ByRef SupportType1 As eObjType,
    	ByRef SupportName2 As String,
    	ByRef SupportType2 As eObjType
    ) As Integer

    Dim instance As cFrameObj
    Dim Name As String
    Dim SupportName1 As String
    Dim SupportType1 As eObjType
    Dim SupportName2 As String
    Dim SupportType2 As eObjType
    Dim returnValue As Integer

    returnValue = instance.GetSupports(Name,
    	SupportName1, SupportType1, SupportName2,
    	SupportType2)

    int GetSupports(
    	String^ Name,
    	String^% SupportName1,
    	eObjType% SupportType1,
    	String^% SupportName2,
    	eObjType% SupportType2
    )

    abstract GetSupports :
            Name : string *
            SupportName1 : string byref *
            SupportType1 : eObjType byref *
            SupportName2 : string byref *
            SupportType2 : eObjType byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame beam object

SupportName1

    Type: SystemString
The name of the column frame object, beam frame object or wall area object
which supports the beam at its start node

SupportType1

    Type: ETABSv1eObjType
A value from the eObjType
enumeration

SupportName2

    Type: SystemString
The name of the column frame object, beam frame object or wall area object
which supports the beam at its end node

SupportType2

    Type: ETABSv1eObjType
A value from the eObjType
enumeration

#### Return Value

Type: Int32

Remarks

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com